BigTree25/STM32_Project/STM32_Project/20 串口收发数据包实验/Hardware/Serial.c
#include "stm32f10x.h"                  // Device header
#include <stdio.h>

uint8_t Serial_TxPacket[4];
uint8_t Serial_RxPacket[4];
uint8_t Serial_pRxPacket;
uint8_t Serial_RxFlag;

void Serial_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	USART_InitTypeDef USART_InitStucture;
	USART_InitStucture.USART_BaudRate = 9600;
	USART_InitStucture.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStucture.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
	USART_InitStucture.USART_Parity = USART_Parity_No;
	USART_InitStucture.USART_StopBits = USART_StopBits_1;
	USART_InitStucture.USART_WordLength = USART_WordLength_8b;
	USART_Init(USART1, &USART_InitStucture);
	
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	
	NVIC_InitTypeDef NVIC_InitStucture;
	NVIC_InitStucture.NVIC_IRQChannel = USART1_IRQn;
	NVIC_InitStucture.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStucture.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStucture.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NVIC_InitStucture);
	
	USART_Cmd(USART1, ENABLE);
}

void Serial_SendByte(uint8_t Byte)
{
	USART_SendData(USART1, Byte);
	while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET);
}

void Serial_SendArray(uint8_t *Array, uint16_t Length)
{
	uint16_t i;
	for(i = 0; i < Length; i ++)
	{
		Serial_SendByte(Array[i]);
	}
}

void Serial_SendString(char *String)
{
	uint8_t i;
	for(i = 0; String[i] != 0; i ++)
	{
		Serial_SendByte(String[i]);
	}
}

uint32_t Serial_Pow(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1;
	while (Y --)
	{
		Result *= X;
	}
	return Result;
}

void Serial_SendNumber(uint32_t Number, uint8_t Length)
{
	uint8_t i;
	for (i = 0; i < Length; i ++)
	{
		Serial_SendByte(Number / Serial_Pow(10, Length - i - 1) % 10 + '0');
	}
}

int fputc(int ch, FILE *f)
{
	Serial_SendByte(ch);
	return ch;
}

//void Serial_Printf(char *format, ...)
//{
//	char String[100];
//	va_list arg;
//	va_start(arg, format);
//	vsprintf(String, format, arg);
//	va_end(arg);
//	Serial_SendString(String);
//}

uint8_t Serial_GetRxFlag(void)
{
	if(Serial_RxFlag == 1)
	{
		Serial_RxFlag = 0;
		return 1;
	}
	return 0;
}

void Serial_SendTxPacket(uint8_t TxPacket[])
{
	Serial_SendByte(0xFF);
	Serial_SendArray(TxPacket, 4);
	Serial_SendByte(0xFE);
}

void USART1_IRQHandler(void)
{
	static uint8_t RxState = 0;
	
	if(USART_GetFlagStatus(USART1, USART_IT_RXNE) == SET)
	{
		if(RxState == 0)
		{
			if(USART_ReceiveData(USART1) == 0xFF)
			{
				RxState = 1;
				Serial_pRxPacket = 0;
			}
		}else if(RxState == 1)
		{
			Serial_RxPacket[Serial_pRxPacket] = USART_ReceiveData(USART1);
			Serial_pRxPacket++;
			if(Serial_pRxPacket >= 4)
			{
				RxState = 2;
			}
		}else if(RxState == 2)
		{
			if(USART_ReceiveData(USART1) == 0xFE)
			{
				RxState = 0;
				Serial_RxFlag = 1;
			}
		}	
		USART_ClearITPendingBit(USART1, USART_IT_RXNE);
	}
}
